Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
wn after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-cpu-alarm"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all                              = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-cpu-alarm"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + threshold                             = 75
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.memory_utilization will be created
+ resource "aws_cloudwatch_metric_alarm" "memory_utilization" {
      + actions_enabled                       = true
      + alarm_description                     = "Redis memory utilization is too high"
      + alarm_name                            = "crawlinghub-redis-prod-memory-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-memory-alarm"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all                              = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-memory-alarm"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # aws_elasticache_cluster.main will be created
+ resource "aws_elasticache_cluster" "main" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "crawlinghub-redis-prod"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.0"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = "sun:05:00-sun:07:00"
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.small"
      + num_cache_nodes            = 1
      + parameter_group_name       = "crawlinghub-redis-prod"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_retention_limit   = 7
      + snapshot_window            = "03:00-05:00"
      + subnet_group_name          = "crawlinghub-redis-prod"
      + tags                       = {
          + "Component"   = "elasticache-cluster"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all                   = {
          + "Component"   = "elasticache-cluster"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + transit_encryption_enabled = (known after apply)

      + log_delivery_configuration {
          + destination      = "/aws/elasticache/crawlinghub-redis-prod/engine-log"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "engine-log"
        }
      + log_delivery_configuration {
          + destination      = "/aws/elasticache/crawlinghub-redis-prod/slow-log"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "slow-log"
        }
    }

  # aws_elasticache_parameter_group.main will be created
+ resource "aws_elasticache_parameter_group" "main" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = "crawlinghub-redis-prod"
      + tags        = {
          + "Component"   = "parameter-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all    = {
          + "Component"   = "parameter-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }

      + parameter {
          + name  = "maxmemory-policy"
          + value = "allkeys-lru"
        }
      + parameter {
          + name  = "timeout"
          + value = "300"
        }
    }

  # aws_elasticache_subnet_group.main will be created
+ resource "aws_elasticache_subnet_group" "main" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "crawlinghub-redis-prod"
      + subnet_ids  = (sensitive value)
      + tags        = {
          + "Component"   = "elasticache-subnet-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all    = {
          + "Component"   = "elasticache-subnet-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + vpc_id      = (known after apply)
    }

  # aws_security_group.redis will be created
+ resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for crawlinghub-redis-prod"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Redis from VPC"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "crawlinghub-redis-prod-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-sg"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all               = {
          + "Component"   = "security-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-sg"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_ssm_parameter.redis_endpoint will be created
+ resource "aws_ssm_parameter" "redis_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Redis endpoint for crawlinghub"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/prod/redis/endpoint"
      + tags           = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "ssm-crawlinghub-redis-prod-endpoint"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all       = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "ssm-crawlinghub-redis-prod-endpoint"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.redis_port will be created
+ resource "aws_ssm_parameter" "redis_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Redis port for crawlinghub"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/prod/redis/port"
      + tags           = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "ssm-crawlinghub-redis-prod-port"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all       = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "ssm-crawlinghub-redis-prod-port"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_id           = (known after apply)
+ endpoint             = (known after apply)
+ engine_log_group     = "/aws/elasticache/crawlinghub-redis-prod/engine-log"
+ parameter_group_name = "crawlinghub-redis-prod"
+ port                 = 6379
+ security_group_id    = (known after apply)
+ slow_log_group       = "/aws/elasticache/crawlinghub-redis-prod/slow-log"
+ subnet_group_name    = "crawlinghub-redis-prod"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/elasticache-redis
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Felasticache-redis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/elasticache-redis
  ```
Plan: 10 to add, 0 to change, 0 to destroy.

---
### 4. dir: `terraform/sqs-queue` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/34/default/terraform/sqs-queue/default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/34/default/terraform/sqs-queue": exit status 1
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: invalid queue name: crawlinghub-schedule-trigger-prod.fifo-dlq
│ 
│   with aws_sqs_queue.schedule_trigger_dlq,
│   on main.tf line 83, in resource "aws_sqs_queue" "schedule_trigger_dlq":
│   83: resource "aws_sqs_queue" "schedule_trigger_dlq" {
│ 
╵


```
</details>

---
### Plan Summary

4 projects, 3 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```